## 1. Question Posed

As we all konw, Titanic event is one of the most famous disasters throughout the world. More than 1500 people total died, including passengers and crew, and there were an estimated 2224 people aboard the ship.  What I am concerned about is:
- **What factors make people more likely to survive?**
-

## 2. Cleaning & Exploring Data
First of all, I need to load the csv file.

In [250]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# load the csv file
titanic_data = pd.read_csv('titanic-data.csv')
titanic_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [251]:
# Make sure each PassengerId is unique
unique_id = titanic_data['PassengerId'].unique()
print len(unique_id) == len(titanic_data)

True

In [252]:
# Identify the fields containing missing values and the amount
titanic_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

> The numbers above indicate there are only 3 fields containing missing/NA values: **_Age, Cabin_** and **_Embarked_**. However, the field _Cabin_ may have little affect, thus there is no change at present. _Embarked_ contains only 2 Na, which is evry low relative to the total. So we decide to abandon the two rows. As for field _Age_, filling the NaN with **mean** value shold be a better choice.

In [253]:
# Abandon those rows where 'Emvarked' is NaN
titanic_data['Embarked'].dropna(inplace=True)

In [254]:
grouped_copy_age = titanic_copy.groupby(['Pclass', 'Sex']).mean()['Age']
grouped_copy_age

Pclass  Sex
1       female    34.611765
        male      41.281386
2       female    28.722973
        male      30.740707
3       female    21.750000
        male      26.507589
Name: Age, dtype: float64

In [325]:
fixed_age = pd.DataFrame(columns=['Age'])
fixed_age

Empty DataFrame
Columns: [Age]
Index: []

In [326]:
def fix_age(pclass, sex):

    missing_age = titanic_data[(titanic_data['Pclass']==pclass) & (titanic_data['Sex']==sex)]['Age']
    
    # Replace the missing values of 'Age' column with the mean value.
    filled_value = grouped_copy_age.loc[pclass, sex]
    missing_age.fillna(filled_value, inplace=True)

    return pd.DataFrame(missing_age)

In [329]:
female1_age = fix_age(1, 'female')
female2_age = fix_age(2, 'female')
female3_age = fix_age(3, 'female')
male1_age = fix_age(1, 'male')
male2_age = fix_age(2, 'male')
male3_age = fix_age(3, 'male')

In [ ]:
frames =

In [335]:
for pclass, sex in grouped_copy.index:
    fix_age(pclass, sex)

           Age
1    38.000000
3    35.000000
11   58.000000
31   34.611765
52   49.000000
61   38.000000
88   23.000000
136  19.000000
151  22.000000
166  34.611765
177  50.000000
194  44.000000
195  58.000000
215  31.000000
218  32.000000
230  35.000000
256  34.611765
257  30.000000
258  35.000000
268  58.000000
269  35.000000
275  63.000000
290  26.000000
291  19.000000
297   2.000000
299  50.000000
306  34.611765
307  17.000000
309  30.000000
310  24.000000
..         ...
591  52.000000
609  40.000000
627  21.000000
641  24.000000
669  34.611765
689  15.000000
700  18.000000
708  22.000000
710  24.000000
716  38.000000
730  29.000000
742  21.000000
759  33.000000
763  36.000000
765  51.000000
779  43.000000
781  17.000000
796  49.000000
809  33.000000
820  52.000000
829  62.000000
835  39.000000
842  30.000000
849  34.611765
853  16.000000
856  45.000000
862  48.000000
871  47.000000
879  56.000000
887  19.000000

[94 rows x 1 columns]
           Age
6    54.000000
23   28.000000
27   19.000000
30   40.000000
34   28.000000
35   42.000000
54   65.000000
55   41.281386
62   45.000000
64   41.281386
83   28.000000
92   46.000000
96   71.000000
97   23.000000
102  21.000000
110  47.000000
118  24.000000
124  54.000000
137  37.000000
139  24.000000
155  51.000000
168  41.281386
170  61.000000
174  56.000000
185  41.281386
187  45.000000
209  40.000000
224  38.000000
245  44.000000
248  37.000000
..         ...
662  47.000000
671  31.000000
679  36.000000
681  27.000000
690  31.000000
694  60.000000
698  49.000000
701  35.000000
707  42.000000
711  41.281386
712  48.000000
724  27.000000
737  35.000000
740  41.281386
741  36.000000
745  70.000000
748  19.000000
766  41.281386
782  29.000000
789  46.000000
793  41.281386
802  11.000000
806  39.000000
815  41.281386
822  38.000000
839  41.281386
857  51.000000
867  31.000000
872  33.000000
889  26.000000

[122 rows x 1 columns]
           Age
9    14.000000
15   55.000000
41   27.000000
43    3.000000
53   29.000000
56   21.000000
58    5.000000
66   29.000000
84   17.000000
98   34.000000
123  32.500000
133  29.000000
161  40.000000
190  32.000000
199  24.000000
211  35.000000
237   8.000000
247  24.000000
259  50.000000
272  41.000000
303  28.722973
312  26.000000
316  24.000000
322  30.000000
323  22.000000
327  36.000000
345  24.000000
346  40.000000
357  38.000000
387  36.000000
..         ...
518  36.000000
526  50.000000
530   2.000000
535   7.000000
546  19.000000
576  34.000000
580  25.000000
596  28.722973
600  24.000000
608  22.000000
615  24.000000
618   4.000000
635  28.000000
651  18.000000
670  40.000000
706  45.000000
717  27.000000
720   6.000000
726  30.000000
747  30.000000
750   4.000000
754  48.000000
772  57.000000
774  54.000000
801  31.000000
854  44.000000
865  42.000000
866  27.000000
874  28.000000
880  25.000000

[76 rows x 1 columns]
           Age
17   30.740707
20   35.000000
21   34.000000
33   66.000000
70   32.000000
72   21.000000
78    0.830000
99   34.000000
117  29.000000
120  21.000000
122  32.500000
134  25.000000
135  23.000000
144  18.000000
145  19.000000
148  36.500000
149  42.000000
150  51.000000
178  30.000000
181  30.740707
183   1.000000
191  19.000000
193   3.000000
213  30.000000
217  42.000000
219  30.000000
221  27.000000
226  19.000000
228  18.000000
232  59.000000
..         ...
672  70.000000
673  31.000000
674  30.740707
684  60.000000
685  25.000000
695  52.000000
705  39.000000
714  52.000000
722  34.000000
723  50.000000
728  25.000000
732  30.740707
733  23.000000
734  23.000000
755   0.670000
757  18.000000
791  16.000000
795  39.000000
800  34.000000
808  39.000000
812  35.000000
817  31.000000
827   1.000000
831   0.830000
841  16.000000
848  28.000000
861  21.000000
864  24.000000
883  28.000000
886  27.000000

[108 rows x 1 columns]
       Age
2    26.00
8    27.00
10    4.00
14   14.00
18   31.00
19   21.75
22   15.00
24    8.00
25   38.00
28   21.75
32   21.75
38   18.00
39   14.00
40   40.00
44   19.00
47   21.75
49   18.00
68   17.00
71   16.00
79   30.00
82   21.75
85   33.00
100  28.00
106  21.00
109  21.75
111  14.50
113  20.00
114  17.00
119   2.00
128  21.75
..     ...
657  32.00
677  18.00
678  43.00
680  21.75
691   4.00
697  21.75
702  18.00
727  21.75
729  25.00
736  48.00
767  30.50
777   5.00
780  13.00
786  18.00
792  21.75
797  31.00
799  30.00
807  18.00
813   6.00
816  23.00
823  27.00
830  15.00
852   9.00
855  18.00
858  24.00
863  21.75
875  15.00
882  22.00
885  39.00
888  21.75

[144 rows x 1 columns]
           Age
0    22.000000
4    35.000000
5    26.507589
7     2.000000
12   20.000000
13   39.000000
16    2.000000
26   26.507589
29   26.507589
36   26.507589
37   21.000000
42   26.507589
45   26.507589
46   26.507589
48   26.507589
50    7.000000
51   21.000000
57   28.500000
59   11.000000
60   22.000000
63    4.000000
65   26.507589
67   19.000000
69   26.000000
73   26.000000
74   32.000000
75   25.000000
76   26.507589
77   26.507589
80   22.000000
..         ...
824   2.000000
825  26.507589
826  26.507589
828  26.507589
832  26.507589
833  23.000000
834  18.000000
836  21.000000
837  26.507589
838  32.000000
840  20.000000
843  34.500000
844  17.000000
845  42.000000
846  26.507589
847  35.000000
850   4.000000
851  74.000000
859  26.507589
860  41.000000
868  26.507589
869   4.000000
870  26.000000
873  47.000000
876  20.000000
877  19.000000
878  26.507589
881  33.000000
884  25.000000
890  32.000000

[347 rows x 1 columns]

In [328]:
result = pd.concat(frames)
len(result)

TypeError: first argument must be an iterable of pandas objects, you passed an object of type "DataFrame"

In [ ]:
grouped_copy_age.iteritems

In [ ]:
for record in grouped_copy_age.iteritems:
    print record

In [ ]:
fixed_age = titanic_data[(titanic_data['Pclass']==1) & (titanic_data['Sex']=='female')]['Age']

fill_value = grouped_copy_age.loc[1, 'female']

# Replace the missing values of 'Age' column with the mean value.
fixed_age.fillna(fill_value, inplace=True)

type(fixed_age)

In [ ]:
titanic_data['Age'][31]

In [ ]:
for row in titanic_data.itertuples():
    if row[a]==1 and row[b]=='female':
        print row[c]

In [ ]:
grouped.loc[1, 'male']

In [ ]:
grouped = titanic_data.groupby('Age', as_index=False).mean()
bar_title = 'Mean survived people by %s' % 'Sex'
bar_title

In [ ]:
grouped['Age'].plot.bar(title=bar_title, alpha=0.5)
plt.show()

As described above, the length between 'unique_id' and 'df' is equal, which shows the original dataset has the **unique PassengerId**.

In [ ]:
corr_coef('Age')

In [ ]:
corr_coef('Survived', 'Pclass')

In [ ]:
data_by_pclass = titanic_data.groupby('Pclass').mean()
Survived = data_by_pclass['Survived']

In [ ]:
Survived.plot.bar(color='k', alpha=0.5)
plt.show()

***
At this point, the data has been initially cleaned up. Let's begin to explore the data.

In [ ]:
data_by_survived = df.groupby('Survived')
data_by_survived.mean()

## 4. Drawing Conclusions

## 5. Data Visualization

In [ ]:
# Locate the items containing NaN attacked to 'Embarked'.
df[df['Embarked'].isnull().values==True]


# Replace the values of 'Sex' with 0 and 1
titanic_data['Sex'] = titanic_data['Sex'].map({'male': 0, 'female': 1}).astype(str).astype(int)

In [ ]:
def corr_coef(item):
    Person_r = np.corrcoef(titanic_data['Survived'], titanic_data[item])
    print "The correlation coefficient between Survived and %s is: %r." % (item, Person_r[0, 1])
    grouped = titanic_data.groupby(item, as_index=False).mean()
    bar_title = 'Mean survived people by %s' % item 
    grouped[item].plot.bar(title=bar_title, color='k', alpha=0.5)
    plt.show()